In [4]:
import numpy as np
import pandas as pd

In [3]:
df2 = pd.read_csv(r'C:\Users\agile\Downloads\Week1_GA_dataset.csv')

In [39]:
df.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,?,Detached House,3,2,1092.0,1.025953,East

In [57]:
df.shape

(10000, 12)

In [41]:
Count = (df=='?').sum().sum()
Count

1823

In [58]:
df1 = df.copy()
df1.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,NaN,Detached House,3,2,1092.0,1.025953,East

In [53]:
df1.loc[df1.Property == 'Single Family','Property'] = 'Single'
df1.head() # replacing only the value having single familyvb

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single,Detached House,3,3,996.0,1.025953,South
1,0,0,0,0.0,0.0,0,0,0,0,0.0,0.000000,0
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,NaN,Detached House,3,2,1092.0,1.025953,East

In [43]:
x = (df.Property == '?').sum()
x

1823

In [45]:
df= df.replace('?',np.nan)
df.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,NaN,Detached House,3,2,1092.0,1.025953,East

In [60]:
vs = df.iloc[692,0]
vs

'2009-11-16'

In [62]:
A = df.iloc[546,7]
A

3

In [63]:
df['Locality'].unique()

array(['Waterbury', 'Bridgeport', 'Greenwich', 'Norwalk', nan,
       'Fairfield', 'West Hartford', 'Stamford'], dtype=object)

In [66]:
Null_count = df2.isna().sum()
Null_count[Null_count>0]

Locality           1253
Estimated Value    1243
carpet_area        1229
dtype: int64

In [70]:
Missing1 = df2[df2.isna().sum(axis=1) <= 2 ]
Missing1.shape

(9978, 12)

In [89]:
Miss = df2[df2.isna().sum(axis=1) < 1 ]
Miss.shape

(6700, 12)

In [85]:
miss1 = df2.isna()
miss1.shape

(10000, 12)

In [109]:
even = df2.iloc[::2]
even

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,?,Detached House,3,2,1092.0,1.025953,East
6,2009-01-02,2009,Norwalk,571060.0,1000000.0,Single Family,Detached House,3,2,NaN,1.025953,South
8,2009-01-02,2009,NaN,603540.0,1680000.0,Single Family,Detached House,3,1,1039.0,1.025953,East
...,...,...,...,...,...,...,...,...,...,...,...,...
9990,2022-09-30,2022,NaN,352030.0,700000.0,?,Detached House,3,3,958.0,1.003979,North
9992,2022-09-30,2022,Fairfield,NaN,680000.0,Single Family,Detached House,3,2,908.0,1.003979,West
9994,2022-09-30,2022,NaN,155550.0,215000.0,Three Family,Triplex,6,5,2114.0,1.003979,North
9996,2022-09-30,2022,Bridgeport,109820.0,340000.0,?,Duplex,4,4,1416.0,1.003979,North
9998,2022-09-30,2022,NaN,216420.0,415000.0,Single Family,Detached House,3,3,1014.0,1.003979,North

In [110]:
int(even.iloc[0,3])

111440

In [117]:
even.iloc[255,3]

798070.0

In [112]:
odd = df2.iloc[1::2]
odd

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
5,2009-01-02,2009,Greenwich,2868880.0,3300000.0,Single Family,Detached House,3,1,1039.0,1.025953,North
7,2009-01-02,2009,Greenwich,592760.0,920000.0,Single Family,Detached House,3,3,937.0,1.025953,North
9,2009-01-02,2009,Bridgeport,137901.0,245000.0,Single Family,Detached House,3,1,956.0,1.025953,West
...,...,...,...,...,...,...,...,...,...,...,...,...
9991,2022-09-30,2022,Norwalk,344270.0,512500.0,Single Family,Detached House,3,3,NaN,1.003979,West
9993,2022-09-30,2022,West Hartford,121870.0,235000.0,Single Family,Detached House,3,2,1087.0,1.003979,South
9995,2022-09-30,2022,Bridgeport,153660.0,322000.0,?,Detached House,3,3,917.0,1.003979,North
9997,2022-09-30,2022,Waterbury,83210.0,170000.0,Single Family,Detached House,3,1,964.0,1.003979,South
9999,2022-09-30,2022,Norwalk,154920.0,196000.0,Single Family,Detached House,3,1,932.0,1.003979,East

In [114]:
odd.iloc[100,5]

'Single Family'

In [119]:
recent = df2['Year'].dropna().sort_values(ascending=False).unique()[:6]
df_recent = df2[df2['Year'].isin(recent)]
num = len(df_recent)
num

4749

In [136]:
and_op = df2[(df2.num_rooms == 3) | (df2.num_bathrooms == 3) ]
and_op.shape

(8591, 12)

In [141]:
cond = df2[(df2.Year == 2022) & (df2.Locality == 'Greenwich') & (df2.num_rooms == 3) & ((df2.Face == 'South') | (df2.Face == 'North'))]
cond.shape

(36, 12)

In [142]:
import pandas as ps

In [147]:
query = SELECT * FROM df2 where Face='North'
result = ps.sqldf(Query,locals())
result

SyntaxError: invalid syntax (2804451060.py, line 1)

In [8]:
PT = df2.pivot_table(values = 'Sale Price', index = 'Locality', aggfunc = 'mean')
PT

                 Sale Price
Locality
Bridgeport     1.740953e+05
Fairfield      7.277225e+05
Greenwich      2.270224e+06
Norwalk        5.590959e+05
Stamford       6.305313e+05
Waterbury      1.062152e+05
West Hartford  3.385472e+05

In [9]:
df2.groupby('Locality')['Sale Price'].mean()

Locality
Bridgeport       1.740953e+05
Fairfield        7.277225e+05
Greenwich        2.270224e+06
Norwalk          5.590959e+05
Stamford         6.305313e+05
Waterbury        1.062152e+05
West Hartford    3.385472e+05
Name: Sale Price, dtype: float64

In [4]:
df2['Date']= pd.to_datetime(df2['Date'])

In [6]:
aug = df2[df2['Date'].dt.month == 8]
aug.shape

(1050, 12)

In [5]:
pr = pd.read_csv(r"C:\Users\agile\Downloads\Preprocessing1.csv")
pr.head()

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Month,WeekDay,Day
0,Jet Airways,Delhi,Banglore,DEL → BOM → COK,20:00,04:25 10 Jun,26h 35m,1 stop,In-flight meal not included,14924,6,Thursday,6.0
1,Jet Airways,Delhi,Cochin,DEL → BOM → COK,16:00,19:00 10 Jun,27h,1 stop,In-flight meal not included,10577,6,Sunday,9.0
2,Jet Airways,Mumbai,Hyderabad,BOM → HYD,19:35,21:05,1h 30m,non-stop,No info,5678,3,Friday,15.0
3,Multiple carriers,Delhi,Banglore,DEL → BOM → COK,18:55,01:30 16 Jun,15h 10m,1 stop,In-flight meal not included,7408,5,Monday,6.0
4,Air India,Delhi,Cochin,DEL → COK,17:10,17:55,8h 20m,non-stop,No info,6724,6,Monday,24.0

In [13]:
avg = pr['Price'].mean()
avg

9027.895555555555

In [22]:
high_fli = pr.pivot_table(values='Airline',index='Month',aggfunc='count')
high_fli

       Airline
Month
3         2388
4          926
5         3092
6         3044

In [20]:
month_counts = pr['Month'].value_counts().sort_index()
month_counts.idxmax()

5

In [39]:
c = pr[(pr.WeekDay== 'Sunday') |(pr.WeekDay== 'Saturday')]['Price'].mean()
#c['Price'].mean()
c

9058.016077170418

In [44]:
d = pr[(pr.WeekDay!= 'Sunday') & (pr.WeekDay!= 'Saturday')]['Price'].mean()
d

9015.219666215608

In [12]:
pr['Additional_Info'] = pr['Additional_Info'].replace('No Info','No info')
pr.head()

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Month,WeekDay,Day
0,Jet Airways,Delhi,Banglore,DEL → BOM → COK,20:00,04:25 10 Jun,26h 35m,1 stop,In-flight meal not included,14924,6,Thursday,6.0
1,Jet Airways,Delhi,Cochin,DEL → BOM → COK,16:00,19:00 10 Jun,27h,1 stop,In-flight meal not included,10577,6,Sunday,9.0
2,Jet Airways,Mumbai,Hyderabad,BOM → HYD,19:35,21:05,1h 30m,non-stop,No info,5678,3,Friday,15.0
3,Multiple carriers,Delhi,Banglore,DEL → BOM → COK,18:55,01:30 16 Jun,15h 10m,1 stop,In-flight meal not included,7408,5,Monday,6.0
4,Air India,Delhi,Cochin,DEL → COK,17:10,17:55,8h 20m,non-stop,No info,6724,6,Monday,24.0

In [14]:
pr1 = pr[(pr.Additional_Info == 'No info' )& (pr.Airline == 'IndiGo' )]
pr1.shape

(1650, 13)

In [16]:
pr['Additional_Info'] = pr['Additional_Info'].replace('No Info', 'No info')

# Count the number of 'IndiGo' flights with 'No info'
indigo_no_info_count = pr[(pr['Airline'] == 'IndiGo') & (pr['Additional_Info'] == 'No info')].shape[0]
indigo_no_info_count

1650

In [33]:
def convert_duration_to_seconds(Duration):
    h= 0
    m=0
    Duration = Duration.strip()
    
    if 'h' in Duration:
        h = int(Duration.split('h')[0])
        Duration = Duration.split('h')[1].strip() if 'h' in Duration else ''
        
    if 'm' in Duration:
        m = int(Duration.replace('m','').strip())
           
    return h*3600 + m*60

pr['Duration'] = pr['Duration'].apply(convert_duration_to_seconds)
pr['Duration'].mean()
#pr['Duration_Seconds'] = pr['Duration'].apply(convert_duration_to_seconds)
#average_duration_seconds = pr['Duration_Seconds'].mean()

38957.93650793651

In [ ]:
# Extract hour from time columns
df['Arrival_Hour'] = df['Arrival_Time'].str.extract(r'(\d{1,2}):').astype(float)
df['Dep_Hour'] = df['Dep_Time'].str.extract(r'(\d{1,2}):').astype(float)

# Define time-of-day classification
def classify_time(hour):
    if 5 <= hour < 12:
        return 'Morning'
    elif 12 <= hour < 17:
        return 'Afternoon'
    elif 17 <= hour < 20:
        return 'Evening'
    else:
        return 'Night'

# Apply classification
df['Dep_TimeOfDay'] = df['Dep_Hour'].apply(classify_time)
df['Arrival_TimeOfDay'] = df['Arrival_Hour'].apply(classify_time)

# Filter for morning departures and evening arrivals
morning_to_evening_flights = df[(df['Dep_TimeOfDay'] == 'Morning') & (df['Arrival_TimeOfDay'] == 'Evening')]

# Count them
count_morning_to_evening = len(morning_to_evening_flights)